RAKWireless/RAK-APOLLO3-RUI/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=Bootloader
menu.debug=Debug
menu.supportnfc=Support NFC
menu.supportat=Support AT
menu.supportlora=Support LoRaWAN
menu.supportAS923=Support LoRaWAN Region AS923
menu.supportAU915=Support LoRaWAN Region AU915
menu.supportCN470=Support LoRaWAN Region CN470
menu.supportCN779=Support LoRaWAN Region CN779
menu.supportEU433=Support LoRaWAN Region EU433
menu.supportEU868=Support LoRaWAN Region EU868
menu.supportKR920=Support LoRaWAN Region KR920
menu.supportIN865=Support LoRaWAN Region IN865
menu.supportUS915=Support LoRaWAN Region US915
menu.supportRU864=Support LoRaWAN Region RU864
menu.supportLA915=Support LoRaWAN Region LA915
# ----------------------------------
# WisBlock Core RAK11720 Board
# ----------------------------------
WisCoreRAK11720Board.name=WisBlock Core RAK11720 Board
WisCoreRAK11720Board.bootloader.tool=bootburn
WisCoreRAK11720Board.build.variant_h=variant_{build.board}.h
WisCoreRAK11720Board.build.series=rak11720

# Upload
WisCoreRAK11720Board.upload.tool=uploader_ymodem
WisCoreRAK11720Board.upload.protocol=uploader_ymodem
WisCoreRAK11720Board.upload.use_1200bps_touch=true
WisCoreRAK11720Board.upload.wait_for_upload_port=true
WisCoreRAK11720Board.upload.maximum_size=917504
WisCoreRAK11720Board.upload.maximum_data_size=392192

# Build
WisCoreRAK11720Board.build.mcu=cortex-m4
WisCoreRAK11720Board.build.f_cpu=48000000
WisCoreRAK11720Board.build.board=WisCore_RAK11720_Board
WisCoreRAK11720Board.build.core=apollo3
WisCoreRAK11720Board.build.variant=WisCore_RAK11720_Board
WisCoreRAK11720Board.build.usb_manufacturer="RAKwireless"
WisCoreRAK11720Board.build.usb_product="WisCore RAK11720 Board"
WisCoreRAK11720Board.build.extra_flags=-DPART_APOLLO3 -DRAK11720+RAK5005-O_V1.0 -Drak11720 -DWISBLOCK_BASE_5005_O {build.flags.usb}
WisCoreRAK11720Board.build.flags.feature=-DLORA_STACK_104 -DLORA_IO_SPI_PORT=1 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DWAN_TYPE=0 -DLORA_STACK_VER=0x040700 -Dgcc -DPART_APOLLO3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 -DAM_FREERTOS -DAM_FREERTOS_STIMER_BACKUP -DAM_BLE_USE_NVM -DAM_CUSTOM_BDADDR -DAM_NUS_ADD -DAM_CUS_ADD -DAM_AMOTA_ADD -DAM_UTIL_FAULTISR_PRINT -DSEC_ECC_CFG=SEC_ECC_CFG_HCI -DRTT_LOG_ENABLED -DDEBUG_ENABLED -DSYS_RTC_COUNTER_PORT=2 -DTWI0_ENABLED -DSPI0_ENABLED -DSPI1_ENABLED -DBLE_SUPPORT -DATCMD_CUST_TABLE_SIZE=64 -DSX1262_CHIP -DARDUINO_AM_AP3_SFE_ARTEMIS_DK -DSOFT_SE -DSECURE_ELEMENT_PRE_PROVISIONED -DLORAMAC_CLASSB_ENABLED -DBLE_CENTRAL_SUPPORT -DSUPPORT_BLE -DSUPPORT_SPI -DSUPPORT_AT -DRUI_SDK
WisCoreRAK11720Board.build.flags.lib_path="-L{runtime.platform.path}/cores/apollo3/app" "-L{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3" "-L{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3/uhal" "-L{runtime.platform.path}/cores/apollo3/external" "-L{runtime.platform.path}/cores/apollo3/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/apollo3/component/udrv/serial" "-L{runtime.platform.path}/cores/apollo3/component/udrv/flash" "-L{runtime.platform.path}/cores/apollo3/component/udrv/timer" "-L{runtime.platform.path}/cores/apollo3/component/service/nvm" "-L{runtime.platform.path}/cores/apollo3/component/udrv/system" "-L{runtime.platform.path}/cores/apollo3/component/udrv/powersave" "-L{runtime.platform.path}/cores/apollo3/component/udrv/wdt" "-L{runtime.platform.path}/cores/apollo3/component/udrv/gpio" "-L{runtime.platform.path}/cores/apollo3/component/udrv/twimst" "-L{runtime.platform.path}/cores/apollo3/component/udrv/delay" "-L{runtime.platform.path}/cores/apollo3/component/udrv/rtc" "-L{runtime.platform.path}/cores/apollo3/component/service/lora" "-L{runtime.platform.path}/cores/apollo3/component/service/runtimeConfig" "-L{runtime.platform.path}/cores/apollo3/component/udrv/delay" "-L{runtime.platform.path}/cores/apollo3/component/udrv/gpio" "-L{runtime.platform.path}/cores/apollo3/component/udrv/rtc" "-L{runtime.platform.path}/cores/apollo3/component/udrv/twimst" "-L{runtime.platform.path}/cores/apollo3/component/udrv/dfu" "-L{runtime.platform.path}/cores/apollo3/component/udrv/pwm" "-L{runtime.platform.path}/cores/apollo3/component/udrv/crypto" "-L{runtime.platform.path}/cores/apollo3/component/udrv/trng" "-L{runtime.platform.path}/cores/apollo3/component/udrv/adc" "-L{runtime.platform.path}/cores/apollo3/component/udrv/pdm" "-L{runtime.platform.path}/cores/apollo3/component/udrv/spimst" "-L{runtime.platform.path}/cores/apollo3/component/udrv/ble" "-L{runtime.platform.path}/cores/apollo3/component/service/battery" "-L{runtime.platform.path}/cores/apollo3/component/service/mode" "-L{runtime.platform.path}/cores/apollo3/component/service/debug" "-L{runtime.platform.path}/cores/apollo3/component/rui_v3_api" "-L{runtime.platform.path}/cores/apollo3/component/fund/event_queue" "-L{runtime.platform.path}/cores/apollo3/component/fund/circular_queue" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
WisCoreRAK11720Board.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/apollo3/app/RAK11720/src" "-I{runtime.platform.path}/cores/apollo3/component/inc" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3/uhal" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3/uhal/serial" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/apollo3/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/apollo3/component/udrv" "-I{runtime.platform.path}/cores/apollo3/component/udrv/serial" "-I{runtime.platform.path}/cores/apollo3/component/udrv/timer" "-I{runtime.platform.path}/cores/apollo3/component/udrv/delay" "-I{runtime.platform.path}/cores/apollo3/component/udrv/spimst" "-I{runtime.platform.path}/cores/apollo3/component/udrv/powersave" "-I{runtime.platform.path}/cores/apollo3/component/udrv/gpio" "-I{runtime.platform.path}/cores/apollo3/component/udrv/rtc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/twimst" "-I{runtime.platform.path}/cores/apollo3/component/udrv/dfu" "-I{runtime.platform.path}/cores/apollo3/component/udrv/crypto" "-I{runtime.platform.path}/cores/apollo3/component/udrv/trng" "-I{runtime.platform.path}/cores/apollo3/component/udrv/pwm" "-I{runtime.platform.path}/cores/apollo3/component/udrv/adc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/system" "-I{runtime.platform.path}/cores/apollo3/component/udrv/ble" "-I{runtime.platform.path}/cores/apollo3/component/udrv/flash" "-I{runtime.platform.path}/cores/apollo3/component/udrv/wdt" "-I{runtime.platform.path}/cores/apollo3/component/udrv/nfc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/pdm" "-I{runtime.platform.path}/cores/apollo3/component/service/lora" "-I{runtime.platform.path}/cores/apollo3/component/service/lora/packages" "-I{runtime.platform.path}/cores/apollo3/component/service/lora/LmHandler" "-I{runtime.platform.path}/cores/apollo3/component/service/runtimeConfig" "-I{runtime.platform.path}/cores/apollo3/component/service/nvm" "-I{runtime.platform.path}/cores/apollo3/component/service/battery" "-I{runtime.platform.path}/cores/apollo3/component/service/debug" "-I{runtime.platform.path}/cores/apollo3/component/service/mode" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/cli" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/transparent" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/protocol" "-I{runtime.platform.path}/cores/apollo3/component/rui_v3_api" "-I{runtime.platform.path}/cores/apollo3/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/apollo3/component/fund/event_queue" "-I{runtime.platform.path}/cores/apollo3/component/fund/circular_queue" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/mac" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/mac/region" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/radio" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/system" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/peripherals" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/boards" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/bootloader" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/apps/amota" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/services" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/profiles/amota" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/utils" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/CMSIS/AmbiqMicro/Include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/CMSIS/ARM/Include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/devices" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/mcu/apollo3" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/mcu/apollo3/regs" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/portable/GCC/AMapollo2" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/portable/MemMang" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/gatt" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/hid" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/uribeacon" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/bas" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/hrps" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/rscp" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/gap" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/apps" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/apps/app" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/services" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/include/app" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/hci/ambiq/apollo3" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/hci/ambiq" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/sec/common" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/dm" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/l2c" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/hci" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/att" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/cfg" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/smp" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources/util" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources/port/freertos" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/uecc" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/mbedtls-2.4.2/include" "-I{runtime.platform.path}/cores/apollo3/external/RTT/RTT" "-I{runtime.platform.path}/cores/apollo3/external/RTT/Config" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Config" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Sample/FreeRTOSv10" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Sample/FreeRTOSv10/Config/Cortex-M" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/SEGGER" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/SYSVIEW" "-I{runtime.platform.path}/cores/apollo3/external/libraries/common" "-I{runtime.platform.path}/cores/apollo3/external/libraries/debug" "-I{runtime.platform.path}/cores/apollo3/external/libraries/ambiq_log" "-I{runtime.platform.path}/cores/apollo3/external/FatFs/source" "-I{runtime.platform.path}/cores/apollo3/external/spiffs/src"
WisCoreRAK11720Board.build.flags.lib=
