RAKWireless/RAK-APOLLO3-RUI/boards.txt
WisCoreRAK11720Board.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/apollo3/app/RAK11720/src" "-I{runtime.platform.path}/cores/apollo3/component/inc" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3/uhal" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/apollo3/uhal/serial" "-I{runtime.platform.path}/cores/apollo3/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/apollo3/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/apollo3/component/udrv" "-I{runtime.platform.path}/cores/apollo3/component/udrv/serial" "-I{runtime.platform.path}/cores/apollo3/component/udrv/timer" "-I{runtime.platform.path}/cores/apollo3/component/udrv/delay" "-I{runtime.platform.path}/cores/apollo3/component/udrv/spimst" "-I{runtime.platform.path}/cores/apollo3/component/udrv/powersave" "-I{runtime.platform.path}/cores/apollo3/component/udrv/gpio" "-I{runtime.platform.path}/cores/apollo3/component/udrv/rtc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/twimst" "-I{runtime.platform.path}/cores/apollo3/component/udrv/dfu" "-I{runtime.platform.path}/cores/apollo3/component/udrv/crypto" "-I{runtime.platform.path}/cores/apollo3/component/udrv/trng" "-I{runtime.platform.path}/cores/apollo3/component/udrv/pwm" "-I{runtime.platform.path}/cores/apollo3/component/udrv/adc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/system" "-I{runtime.platform.path}/cores/apollo3/component/udrv/ble" "-I{runtime.platform.path}/cores/apollo3/component/udrv/flash" "-I{runtime.platform.path}/cores/apollo3/component/udrv/wdt" "-I{runtime.platform.path}/cores/apollo3/component/udrv/nfc" "-I{runtime.platform.path}/cores/apollo3/component/udrv/pdm" "-I{runtime.platform.path}/cores/apollo3/component/service/lora" "-I{runtime.platform.path}/cores/apollo3/component/service/lora/packages" "-I{runtime.platform.path}/cores/apollo3/component/service/lora/LmHandler" "-I{runtime.platform.path}/cores/apollo3/component/service/runtimeConfig" "-I{runtime.platform.path}/cores/apollo3/component/service/nvm" "-I{runtime.platform.path}/cores/apollo3/component/service/battery" "-I{runtime.platform.path}/cores/apollo3/component/service/debug" "-I{runtime.platform.path}/cores/apollo3/component/service/mode" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/cli" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/transparent" "-I{runtime.platform.path}/cores/apollo3/component/service/mode/protocol" "-I{runtime.platform.path}/cores/apollo3/component/rui_v3_api" "-I{runtime.platform.path}/cores/apollo3/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/apollo3/component/fund/event_queue" "-I{runtime.platform.path}/cores/apollo3/component/fund/circular_queue" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/mac" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/mac/region" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/radio" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/system" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/peripherals" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/apollo3/external/lora/LoRaMac-node-4.7.0/src/boards" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/bootloader" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/apps/amota" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/services" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/ambiq_ble/profiles/amota" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/utils" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/CMSIS/AmbiqMicro/Include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/CMSIS/ARM/Include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/devices" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/mcu/apollo3" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/mcu/apollo3/regs" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/portable/GCC/AMapollo2" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/FreeRTOSv10.1.1/Source/portable/MemMang" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/gatt" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/hid" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/uribeacon" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/bas" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/hrps" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/rscp" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/profiles/gap" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/apps" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/apps/app" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/sources/services" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-profiles/include/app" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/hci/ambiq/apollo3" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/hci/ambiq" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/sec/common" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/dm" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/l2c" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/hci" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/att" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/cfg" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/sources/stack/smp" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/ble-host/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources/util" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/sources/port/freertos" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/cordio/wsf/include" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/uecc" "-I{runtime.platform.path}/cores/apollo3/external/AmbiqSuiteSDK/third_party/mbedtls-2.4.2/include" "-I{runtime.platform.path}/cores/apollo3/external/RTT/RTT" "-I{runtime.platform.path}/cores/apollo3/external/RTT/Config" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Config" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Sample/FreeRTOSv10" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/Sample/FreeRTOSv10/Config/Cortex-M" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/SEGGER" "-I{runtime.platform.path}/cores/apollo3/external/SystemView/SYSVIEW" "-I{runtime.platform.path}/cores/apollo3/external/libraries/common" "-I{runtime.platform.path}/cores/apollo3/external/libraries/debug" "-I{runtime.platform.path}/cores/apollo3/external/libraries/ambiq_log" "-I{runtime.platform.path}/cores/apollo3/external/FatFs/source" "-I{runtime.platform.path}/cores/apollo3/external/spiffs/src"
WisCoreRAK11720Board.build.ldscript=flash_apollo3.ld
WisCoreRAK11720Board.build.vid=0x239A
WisCoreRAK11720Board.build.pid=0x8029

