RAKWireless/RAK-APOLLO3-RUI/boards.txt
# Debug Menu
WisCoreRAK11720Board.menu.debug.l0=Level 0 (Release)
WisCoreRAK11720Board.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisCoreRAK11720Board.menu.debug.l1=Level 1 (Error Message)
WisCoreRAK11720Board.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisCoreRAK11720Board.menu.debug.l2=Level 2 (Full Debug)
WisCoreRAK11720Board.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisCoreRAK11720Board.menu.debug.l3=Level 3 (Segger SystemView)
WisCoreRAK11720Board.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisCoreRAK11720Board.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Support AT Menu
WisCoreRAK11720Board.menu.supportat.1=On
WisCoreRAK11720Board.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisCoreRAK11720Board.menu.supportat.2=Off
WisCoreRAK11720Board.menu.supportat.2.build.support_at_flag=-USUPPORT_AT

WisCoreRAK11720Board.menu.supportlora.1=Support LoRaWAN and LoRa P2P
WisCoreRAK11720Board.menu.supportlora.1.build.supportlora=-DSUPPORT_LORA
WisCoreRAK11720Board.menu.supportlora.1.build.supportlora_p2p=-DSUPPORT_LORA_P2P
WisCoreRAK11720Board.menu.supportlora.2=Support LoRaWAN
WisCoreRAK11720Board.menu.supportlora.2.build.supportlora=-DSUPPORT_LORA
WisCoreRAK11720Board.menu.supportlora.2.build.supportlora_p2p=
WisCoreRAK11720Board.menu.supportlora.3=Support LoRa P2P
WisCoreRAK11720Board.menu.supportlora.3.build.supportlora=
WisCoreRAK11720Board.menu.supportlora.3.build.supportlora_p2p=-DSUPPORT_LORA_P2P -DREGION_EU868
WisCoreRAK11720Board.menu.supportlora.4=Not Support
WisCoreRAK11720Board.menu.supportlora.4.build.supportlora=
WisCoreRAK11720Board.menu.supportlora.4.build.supportlora_p2p=

WisCoreRAK11720Board.menu.supportAS923.1=On
WisCoreRAK11720Board.menu.supportAS923.1.build.regionAS923=-DREGION_AS923
WisCoreRAK11720Board.menu.supportAS923.2=Off
WisCoreRAK11720Board.menu.supportAS923.2.build.regionAS923= 

WisCoreRAK11720Board.menu.supportAU915.1=On
WisCoreRAK11720Board.menu.supportAU915.1.build.regionAU915=-DREGION_AU915
WisCoreRAK11720Board.menu.supportAU915.2=Off
WisCoreRAK11720Board.menu.supportAU915.2.build.regionAU915= 

WisCoreRAK11720Board.menu.supportCN470.2=Off
WisCoreRAK11720Board.menu.supportCN470.2.build.regionCN470= 
WisCoreRAK11720Board.menu.supportCN470.1=On
WisCoreRAK11720Board.menu.supportCN470.1.build.regionCN470=-DREGION_CN470

WisCoreRAK11720Board.menu.supportCN779.2=Off
WisCoreRAK11720Board.menu.supportCN779.2.build.regionCN779= 
WisCoreRAK11720Board.menu.supportCN779.1=On
WisCoreRAK11720Board.menu.supportCN779.1.build.regionCN779=-DREGION_CN779

WisCoreRAK11720Board.menu.supportEU433.2=Off
WisCoreRAK11720Board.menu.supportEU433.2.build.regionEU433= 
WisCoreRAK11720Board.menu.supportEU433.1=On
WisCoreRAK11720Board.menu.supportEU433.1.build.regionEU433=-DREGION_EU433

WisCoreRAK11720Board.menu.supportEU868.1=On
WisCoreRAK11720Board.menu.supportEU868.1.build.regionEU868=-DREGION_EU868
WisCoreRAK11720Board.menu.supportEU868.2=Off
WisCoreRAK11720Board.menu.supportEU868.2.build.regionEU868= 

WisCoreRAK11720Board.menu.supportKR920.1=On
WisCoreRAK11720Board.menu.supportKR920.1.build.regionKR920=-DREGION_KR920
WisCoreRAK11720Board.menu.supportKR920.2=Off
WisCoreRAK11720Board.menu.supportKR920.2.build.regionKR920= 

WisCoreRAK11720Board.menu.supportIN865.1=On
WisCoreRAK11720Board.menu.supportIN865.1.build.regionIN865=-DREGION_IN865
WisCoreRAK11720Board.menu.supportIN865.2=Off
WisCoreRAK11720Board.menu.supportIN865.2.build.regionIN865= 

WisCoreRAK11720Board.menu.supportUS915.1=On
WisCoreRAK11720Board.menu.supportUS915.1.build.regionUS915=-DREGION_US915
WisCoreRAK11720Board.menu.supportUS915.2=Off
WisCoreRAK11720Board.menu.supportUS915.2.build.regionUS915= 

WisCoreRAK11720Board.menu.supportRU864.1=On
WisCoreRAK11720Board.menu.supportRU864.1.build.regionRU864=-DREGION_RU864
WisCoreRAK11720Board.menu.supportRU864.2=Off
WisCoreRAK11720Board.menu.supportRU864.2.build.regionRU864= 

WisCoreRAK11720Board.menu.supportLA915.1=On
WisCoreRAK11720Board.menu.supportLA915.1.build.regionLA915=-DREGION_LA915
WisCoreRAK11720Board.menu.supportLA915.2=Off
WisCoreRAK11720Board.menu.supportLA915.2.build.regionLA915=
